app/controllers/customers_controller.rb

    def create
      @customer = Customer.new(customer_params)

      if @customer.save
---
INSERT INTO "customers" ("name", "email", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "alfred"], ["email", "alfred@gmail.com"], ["phone", "'02904083012"], ["address", nil], ["created_at", "2023-09-04 08:58:02.236285"], ["updated_at", "2023-09-04 08:58:02.236285"]]

    def destroy
      @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]