app/controllers/gate_passes_controller.rb

    def index
      @gate_pass = GatePass.all
---
SELECT "gate_passes".* FROM "gate_passes"