app/controllers/invoice_items_controller.rb

SELECT "invoice_items".* FROM "invoice_items"
---
    def index
      @invoice_items = InvoiceItem.all