app/controllers/load_authorities_controller.rb

    def index
      @load_authority = LoadAuthority.all
---
SELECT "load_authorities".* FROM "load_authorities"