app/controllers/order_confirmations_controller.rb

SELECT "order_confirmations".* FROM "order_confirmations"
---
    def index
      @order_confirmations = OrderConfirmation.all