app/controllers/payments_received_controller.rb

    def index
      @payment_received = PaymentReceived.all
---
SELECT "payment_receiveds".* FROM "payment_receiveds"