app/controllers/proforma_invoices_controller.rb

    def index
      @proforma_invoices = ProformaInvoice.all
---
SELECT "proforma_invoices".* FROM "proforma_invoices"